JS-CS-Detection-byExample/Dataset (ALERT 5 GB)/374130/spot-1.2.5/spot-1.2.5/doc/userdoc/tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Command-line tools installed by Spot 1.2.5</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Command-line tools installed by Spot 1.2.5"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-08-21T17:41+0200"/>
<meta name="author" content="Alexandre Duret-Lutz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="http://spot.lip6.fr/css/spot-zenburn.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Command-line tools installed by Spot 1.2.5</h1>

<p>This document introduces command-line tools that are installed with
the Spot library.  We give some examples to highlight possible
use-cases but shall not attempt to cover all features exhaustively
(please check the man pages for further inspiration).
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Conventions</a></li>
<li><a href="#sec-2">Common options</a></li>
<li><a href="#sec-3">Command-line tools</a></li>
<li><a href="#sec-4">Advanced uses</a></li>
<li><a href="#sec-5">Citing</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Conventions</h2>
<div class="outline-text-2" id="text-1">


<p>
For technical reasons related to the way we generate these pages, we
use the following convention when rendering shell commands.  The
commands issued to the shell are formatted like this with a green line
on the left:
</p>



<pre class="src src-sh"><span class="org-builtin">echo</span> Hello World
</pre>


<p>
And the output of such a command is formatted as follows, with a red
line on the left:
</p>
<pre class="example">
Hello World
</pre>


<p>
Parts of these documents (e.g., lists of options) are actually the
results of shell commands and will be presented as above, even if the
corresponding commands are hidden.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Common options</h2>
<div class="outline-text-2" id="text-2">


<ul>
<li><a href="ioltl.html">common input and output options for LTL/PSL formulas</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Command-line tools</h2>
<div class="outline-text-2" id="text-3">


<ul>
<li><a href="randltl.html"><code>randltl</code></a> Generate random LTL/PSL formulas.
</li>
<li><a href="ltlfilt.html"><code>ltlfilt</code></a> Filter LTL/PSL formulas.
</li>
<li><a href="genltl.html"><code>genltl</code></a> Generate LTL formulas from scalable patterns.
</li>
<li><a href="ltl2tgba.html"><code>ltl2tgba</code></a> Translate LTL/PSL formulas into B端chi automata.
</li>
<li><a href="ltl2tgta.html"><code>ltl2tgta</code></a> Translate LTL/PSL formulas into Testing automata.
</li>
<li><a href="ltlcross.html"><code>ltlcross</code></a> Cross-compare LTL/PSL-to-B端chi translators.
</li>
<li><a href="dstar2tgba.html"><code>dstar2tgba</code></a> Convert deterministic Rabin or Streett automata into
  B端chi automata.
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Advanced uses</h2>
<div class="outline-text-2" id="text-4">


<ul>
<li><a href="csv.html">Reading and writing CSV files</a>
</li>
<li><a href="satmin.html">SAT-based minimization of Deterministic (Generalized) B端chi automata</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Citing</h2>
<div class="outline-text-2" id="text-5">


<p>
If you want to refer to these tools in an article, please cite one of
the following articles:
</p>
<ul>
<li><b>Manipulating LTL formulas using Spot 1.0</b>, <i>Alexandre Duret-Lutz</i>.
  In Proc. of ATVA'13, LNCS 8172, pp. 442&ndash;445.  Hanoi, Vietnam,
  Oct. 2013.  (<a href="http://www.lrde.epita.fr/~adl/dl/adl_bib.html#duret.13.atva">bib</a> | <a href="https://www.lrde.epita.fr/~adl/dl/adl/duret.13.atva.pdf">pdf</a> | <a href="https://www.lrde.epita.fr/~adl/dl/adl/duret.13.atva.slides.pdf">slides</a>)

<p>
  This focuses on <code>ltlfilt</code>, <code>randltl</code>, and <code>ltlcross</code>.
</p>
</li>
<li><b>LTL translation improvements in Spot 1.0</b>, <i>Alexandre Duret-Lutz</i>.
  Int. J. on Critical Computer-Based Systems, 5(1/2):31&ndash;54, March 2014.
  (<a href="https://www.lrde.epita.fr/~adl/dl/adl_bib.html#duret.14.ijccbs">bib</a> | <a href="https://www.lrde.epita.fr/~adl/dl/adl/duret.14.ijccbs.draft.pdf">pdf</a>)

<p>
  This describes the translation from LTL to TGBA used by <code>ltl2tgba</code>
  and <code>ltl2tgta</code>.
</p>
</li>
<li><b>Model checking using generalized testing automata</b>, <i>Ala Eddine Ben   Salem</i>, <i>Alexandre Duret-Lutz</i>, and <i>Fabrice Kordon</i>.  In
  Transactions on Petri Nets and Other Models of Concurrency (ToPNoC
  VI), 7400:94&ndash;112, 2012.  (<a href="https://www.lrde.epita.fr/~adl/dl/adl_bib.html#bensalem.12.topnoc">bib</a> | <a href="https://www.lrde.epita.fr/~adl/dl/adl/bensalem.12.topnoc.pdf">pdf</a>)

<p>
  This describes the generalized testing automata produced by <code>ltl2tgta</code>.
</p></li>
</ul>



<p>
Check the man page for each tool for additional references about the
algorithms or data sources used.
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-08-21T17:41+0200</p>
<p class="author">Author: Alexandre Duret-Lutz</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
